modules/users/models/User.php

    public static function getCurrentUser(){
        $userId = Yii::$app->getUser()->getId();
        return self::findOne($userId);
---
SELECT * FROM `user` WHERE `id`=119