modules/contract/views/performer/order/response.php

                <?=$form->field($model, 'price')->textInput(['class'=>''])->label(false)->error(false)?>
            </div>
            <div class="col-sm-2">
                <?=$form->field($model, 'currency_id')->dropDownList(ArrayHelper::map(Currency::find()->all(), 'id', 'name'))->label(false)->error(false)?>
---
SELECT * FROM `currency`