modules/users/views/performer/user/_form.php

                <div class="direction-block">
                    <div class="row">
                        <?
                        $directions = ArrayHelper::map(Direction::find()->andWhere(['parent_id'=>null])->all(), 'id', 'name');
                        $subdirections = Direction::find()->where(['is not', 'parent_id', null])->all();
                        $cphds = ContractPerformerHasDirection::find()->where([
                            'contract_id' => $contract->id,
                        ])->all();
---
SELECT * FROM `direction` WHERE `parent_id` IS NULL
SELECT * FROM `direction` WHERE `parent_id` IS NOT NULL
SELECT * FROM `contract_performer_has_direction` WHERE `contract_id`=63

                        </div>
                        <div class="col-sm-6 spec-second-select">
                            <?
                            echo DepDrop::widget([
                                'name' => 'performer-subdirection',
                                'data' => ArrayHelper::map(Direction::find()->where(['parent_id' => key($directions)])->all(), 'id', 'name'),
                                'options'=>[
                                    'id'=>'performer-subdirection-id',
                                ],
                                'pluginOptions'=>[
                                    'depends'=>['performer-direction-id'],
                                    'url' => '/users/guest/get-subdirection/',
                                ],
                                'pluginEvents' => [
                                    "depdrop.afterChange" => "function(event, id, value) {
                                    var oDropdown = $('#performer-subdirection-id').msDropdown().data('dd');
                                    oDropdown.destroy();
                                    oDropdown = $('#performer-subdirection-id').msDropdown().data('dd');
                                    oDropdown.refresh();
                                }
                                "
                                ]
                            ]);
---
SELECT * FROM `direction` WHERE `parent_id`=1

                <p><?=$model->getAttributeLabel('country')?><span>*</span></p>
            </div>
            <div class="col-sm-8">
                <?=$form->field($model, 'country')->dropDownList(ArrayHelper::map(Country::find()->all(), 'id', 'name'), [
                    'id'=>'performerregform-country',
                    'prompt' => $model->getAttributeLabel('country'),
                ])->label(false)->error(false)?>
---
SELECT * FROM `country`

                <p><?=$model->getAttributeLabel('state')?><span>*</span></p>
            </div>
            <div class="col-sm-8">
                <?= $form->field($model, 'state')->widget(DepDrop::classname(), [
                    'data'=> ArrayHelper::map(State::find()->where(['country_id'=>$model->country])->all(), 'id', 'name'),
                    'options'=>[
                        'id'=>'performerregform-state',
                        'prompt' => $model->getAttributeLabel('state'),
                    ],
                    'pluginOptions'=>[
                        'depends'=>['performerregform-country'],
                        'placeholder' => $model->getAttributeLabel('state'),
                        'url'=>'/users/guest/get-states/',
                    ],
                    'pluginEvents' => [
                        "depdrop.afterChange"=>"function(event, id, value) {
                        var oDropdown = $('#performerregform-state').msDropdown().data('dd');
                        oDropdown.destroy();
                        oDropdown = $('#performerregform-state').msDropdown().data('dd');
                        oDropdown.refresh();
                    }",
                    ],
                ])->label(false)->error(false);?>
---
SELECT * FROM `state` WHERE `country_id`=1