modules/contract/controllers/CommentOrderController.php

SELECT * FROM `order` WHERE `id`=3
SELECT * FROM `order_comment` WHERE `order_id`=3
---
    public function actionIndex($orderId){
        $order = Order::findOne($orderId);
        $comments = $order ? $order->orderComments : [];