modules/contract/controllers/OrderController.php

    public function actionView($orderId){
        $model = Order::findOne($orderId);
---
SELECT * FROM `order` WHERE `id`='3'