modules/contract/controllers/PerformerController.php

SELECT * FROM `order` WHERE `id` IS NULL
SELECT * FROM `contract` WHERE `id`='64'
---
    public function actionProfile($contractId){
        $orderId = \Yii::$app->getRequest()->get('orderId');
        $order = Order::findOne($orderId);
        $model = Contract::findOne($contractId);

SELECT * FROM `contract` WHERE `id`='64'
---
    public function actionOfferOrder($contractId){
        $currentContract = Contract::getCurContract();
        $orders = Order::find()->where([
            'contract_id' => $currentContract->id,
            'status' => Order::STATUS_OPEN
        ])->all();
        $model = Contract::findOne($contractId);